const usersGenerator = (users) => {
  // Массив с именами героев
  const heroNames = [
    "Сафия Сомова",
    "Надежда Кравцова",
    "Мирослава Воронина",
    "София Шувалова",
    "Мария Зайцева",
    "Елисей Дмитриев",
    "Полина Сергеева",
    "Камила Васильева",
    "Михаил Сафонов",
    "Анастасия Позднякова",
    "Милана Михайлова",
    "Вероника Игнатова",
    "Демьян Новиков",
    "Мария Фролова",
    "Максим Мартынов",
    "Дарья Митрофанова",
    "Сергей Платонов",
    "Алиса Смирнова",
    "Ксения Кочергина",
    "Павел Лебедев",
    "Марина Царева",
    "Тимофей Медведев",
    "Татьяна Полякова",
    "Арина Курочкина",
    "Александр Соколов",
    "Ангелина Дорофеева",
    "Ксения Борисова",
    "Дмитрий Кондратов",
    "Ясмина Соболева",
    "Мария Андрианова",
    "Анна Чернышева",
    "Арина Копылова",
    "Александр Поликарпов",
    "Мария Григорьева",
    "Таисия Куликова",
    "Кирилл Сазонов",
    "Анна Белякова",
    "Валерия Никифорова",
    "Василиса Головина",
    "Дмитрий Богомолов",
    "Всеволод Попов",
    "Вероника Родионова",
    "Алиса Захарова",
    "Виктория Безрукова",
    "Иван Голубев",
    "Александр Кузнецов",
    "Варвара Афанасьева",
    "Даниил Одинцов",
    "Егор Зиновьев",
    "Василиса Савельева",
    "Александр Иванов",
    "Ксения Захарова",
    "Савелий Марков",
    "Анастасия Соколова",
    "Марианна Воробьева",
    "Алиса Максимова",
    "Георгий Петров",
    "Мария Фокина",
    "Агата Максимова",
    "Давид Яковлев",
    "Александра Долгова",
    "Арсений Поляков",
    "Игорь Панов",
    "Даниил Олейников",
    "Константин Андрианов",
    "Егор Устинов",
    "Владимир Бирюков",
    "Артём Мальцев",
    "Марьяна Иванова",
    "Максим Андреев",
    "Даниил Колпаков",
    "Павел Рыжов",
    "Милана Ковалева",
    "Михаил Миронов",
    "Мария Черепанова",
    "Алиса Антонова",
    "Сергей Козлов",
    "Арсений Яковлев",
    "Аглая Морозова",
    "Дмитрий Николаев",
    "Мирослава Прокофьева",
    "Анна Морозова",
    "Дарья Ежова",
    "Михаил Васильев",
    "Марьяна Смирнова",
    "Анна Виноградова",
    "Мирон Степанов",
    "Милана Спиридонова",
    `Тимофей Овчинников`,
    "Даниил Ефимов",
    "Семён Гордеев",
    "Александр Пономарев",
    "Матвей Кузин",
    "Ева Богданова",
    "Александр Золотов",
    "Тигран Чернышев",
    "Ксения Ермолаева",
    "Надежда Морозова",
    "Михаил Максимов",
    "Софья Волкова"
  ];

  // Функция для генерации случайного имейла
  function generateEmail(fullName) {
    const nameParts = fullName.toLowerCase().split(" ");
    const username = nameParts.join(".");
    return `${username}@почта.сом`;
  }

  // Функция для генерации случайного телефонного номера
  function generatePhoneNumber() {
    const digits = "0123456789";
    let phoneNumber = "0";

    for (let i = 0; i < 8; i++) {
      phoneNumber += digits.charAt(Math.floor(Math.random() * digits.length));
    }

    return phoneNumber.replace(/(\d{2})(\d{2})(\d{2})(\d{2})/, "$1-$2-$3-$4");
  }

  // Генерация массива объектов
  const heroes = [];

  for (let i = 0; i < users; i++) {
    const id = i;
    const fullName = heroNames[Math.floor(Math.random() * heroNames.length)];
    const email = generateEmail(fullName);
    const number = generatePhoneNumber();

    const hero = {
      id,
      fullName,
      email,
      number
    };

    heroes.push(hero);
  }

  return heroes;
};

export default usersGenerator;
